step-by-step/030-populate-database/020-soap/0900-ip-ресурсы/0100.xml

<?xml version="1.0" ?>
<!-- Создаем категорию IP-ресурса -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:ipCategoryUpdate xmlns:common="http://common.bitel.ru"
                              xmlns:ns5="http://common.resource.inventory.systems.oss.bitel.ru/"
                              xmlns:xs="http://www.w3.org/2001/XMLSchema"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <category xmlns="" id="0" parentId="0" title="192.168.200.0/24"></category>
        </ns5:ipCategoryUpdate>
    </S:Body>
</S:Envelope>
